from collections import OrderedDict
from allpairspy import AllPairs


if __name__ == '__main__':
    parameters = OrderedDict({
        # "社保默认基数": ["基于员工信息：合同-自定义数字", "基于员工信息：合同-自定义单选，单选为数字","基于员工信息：空(不选择项目)","基于员工信息：薪资档案的年度总收入","基于员工信息：薪资档案的自定义数字","基于员工信息：薪资档案的自定义单选，单选为数字","基于薪资计划：基本薪资","基于薪资计划:基本薪资+岗位补贴","基于薪资计划:空(不选择项目）","基于薪资计划:自定义项目","基于薪资计划:基本薪资+自定义项目"],
        # "公积金默认基数": ["基于员工信息：合同-自定义数字", "基于员工信息：合同-自定义单选，单选为数字","基于员工信息：空(不选择项目)","基于员工信息：薪资档案的年度总收入","基于员工信息：薪资档案的自定义数字","基于员工信息：薪资档案的自定义单选，单选为数字","基于薪资计划：基本薪资","基于薪资计划:基本薪资+岗位补贴","基于薪资计划:空(不选择项目）","基于薪资计划:自定义项目","基于薪资计划:基本薪资+自定义项目"],
        # "默认不参保": ["正式", "实习生", "兼职","自定义","所有"]
        "性别": ["男", "女"],
        "年级": ["一年级", "二年级","三年纪","四年级"],
    })

    print("PAIRWISE:")
    for i, pairs in enumerate(AllPairs(parameters)):
        print("用例编号{:2d}: {}".format(i, pairs))